---
title: 网络设计初测


---



![image-20211014114732263](https://gitee.com/lsyzc/picture/raw/master/picture/image-20211014114732263.png)

## 在AS1、AS2、AS3上划分vlan

1. as1

```bash
AS1(config)#vlan 10
AS1(config-vlan)#vlan 11
AS1(config-vlan)#int f0/1
AS1(config-if)#switchport mode access
AS1(config-if)#switchport access vlan 11
AS1(config-if)#int g0/2
AS1(config-if)#switchport mode access
AS1(config-if)#switchport access vlan 10
```

2. as2

```bash
AS2(config)#vlan 11
AS2(config-vlan)#vlan 22
AS2(config-vlan)#int f0/1
AS2(config-if)#switchport mode access
AS2(config-if)#switchport access vlan 11
AS2(config-if)#int f0/2
AS2(config-if)#switchport mode access
AS2(config-if)#switchport access vlan 22
```

3. as3

```bash
AS3(config)#vlan 22
AS3(config-vlan)#vlan 33
AS3(config-vlan)#int f0/1
AS3(config-if)#switchport mode access
AS3(config-if)#switchport access vlan 22
AS3(config-if)#int f0/2
AS3(config-if)#switchport mode access
AS3(config-if)#switchport access vlan 33
```



## 在CS上配置vlan和trunk

在CS配置vlan10、vlan11、vlan22、vlan33、vlan254，把G1/0/10和G1/0/11加入vlan254，G1/0/1、G1/0/2、G1/0/3设为trunk模式

```bash
CS(config)#vlan 10
CS(config-vlan)#vlan 11
CS(config-vlan)#vlan 22
CS(config-vlan)#vlan 33
CS(config-vlan)#vlan 254
CS(config-vlan)#int g1/0/10
CS(config-if)#switchport mode access
CS(config-if)#switchport access vlan 254
CS(config-if)#int g1/0/11
CS(config-if)#switchport mode access
CS(config-if)#switchport access vlan 254

CS(config-if)#int g1/0/1
CS(config-if)#switchport trunk encapsulation dot1q 
CS(config-if)#switch mode trunk

CS(config-if)#int g1/0/2
CS(config-if)#switchport trunk encapsulation dot1q 
CS(config-if)#switch mode trunk


CS(config-if)#int g1/0/3
CS(config-if)#switchport trunk encapsulation dot1q 
CS(config-if)#switch mode trunk
```

## 在核心三层交换机CS上启用三层交换，并设置vlan间路由

```bash
CS(config)#ip routing//开启三层交换
CS(config)#int vlan 11
CS(config-if)#ip address 172.16.11.254 255.255.255.0
CS(config-if)#no shutdown

CS(config-if)#int vlan 22
CS(config-if)#no shutdown

CS(config-if)#int vlan 33
CS(config-if)#ip address 172.16.33.254 255.255.255.0
CS(config-if)#no shutdown
	
CS(config-if)#int vlan 10
CS(config-if)#ip address 172.16.10.254 255.255.255.0
CS(config-if)#no shutdown

CS(config-if)#int vlan 254
CS(config-if)#ip address 172.16.254.254 255.255.255.0
CS(config-if)#no shutdown
```

## 配置cs到fw的默认路由和fw到局域网的路由

```bash
CS(config)#ip route 0.0.0.0 0.0.0.0 172.16.1.1
FW(config)#ip route 172.16.0.0 0.0.255.255 172.16.1.2
```

此时局域网内vlan路由以配好，相同vlan间可通信。

## 配置fw的出口路由和nat

1. 静态路由

```ba
FW(config)#ip route 0.0.0.0 0.0.0.0 1.0.0.1
```

2. 配置nat实现互联网访问
   + 配置转换访问控制列表
   + 配置nat转换
   + 设定inside outside

```bash
FW(config)#access-list 102 deny ip 172.16.0.0 0.0.255.255 192.168.1.0 0.0.0.255
FW(config)#access-list 102 permit ip 172.16.0.0 0.0.255.255 any
FW(config)#ip nat inside source list 102 interface g0/0/0 overload
FW(config)#int g0/0/0
FW(config-if)#ip nat outside
FW(config-if)#int f0/0
FW(config-if)#ip nat inside
```

## 在ISP1、ISP2、ISP3开启ospf

ISP1

```bash
ISP1(config)#route ospf 1
ISP1(config-router)#network 1.0.0.0 0.0.0.7 area 0
ISP1(config-router)#network 2.0.0.0 0.255.255.255 area 0
ISP1(config-router)#network 3.0.0.0 0.255.255.255 area 0
```



ISP2

```bash
ISP2(config)#route ospf 1
ISP2(config-router)#network 2.0.0.0 0.255.255.255 area 0
ISP2(config-router)#network 4.0.0.0 0.255.255.255 area 0
ISP2(config-router)#network 5.0.0.0 0.255.255.255 area 0
```



ISP3

```bash
ISP3(config)#route ospf 1
ISP3(config-router)#network 3.0.0.0 0.255.255.255 area 0
ISP3(config-router)#network 4.0.0.0 0.255.255.255 area 0
ISP3(config-router)#network 7.0.0.0 0.0.0.3 area 0
ISP3(config-router)#network 6.0.0.0 0.0.0.3 area 0
```

## 在分公司路由器Div_R配置默认路由和地址转换NAT

```bash
div_R(config)#ip route 0.0.0.0 0.0.0.0 6.0.0.1
div_R(config)#access-list 102 deny ip 192.168.1.0 0.0.0.255 172.16.0.0 0.0.255.255
div_R(config)#access-list 102 permit ip 192.168.1.0 0.0.0.255 any
div_R(config)#ip nat inside source list 102 interface g0/0/0 overload
div_R(config)#int g0/0/0
div_R(config-if)#ip nat outside
div_R(config-if)#int f0/0
div_R(config-if)#ip nat inside
```

## 配置总部到分公司端到端VPN

在总部FW配置端到端IPSec VPN，对端为6.0.0.2，认证方式为pre−share，key为123，加密方式为ah−md5−hmac esp−des，从总部172.16.0.0到分公司192.168.1.0的流量加密

```bash
FW(config)#crypto isakmp enable
FW(config)#crypto isakmp policy 1
FW(config-isakmp)#hash md5
FW(config-isakmp)#authentication pre-share
FW(config)#crypto isakmp key 123 address 6.0.0.2
FW(config)#crypto ipsec transform-set testform ah-md5-hmac esp-des
FW(config)#access-list 101 permit ip 172.16.0.0 0.0.255.255 192.168.1.0 0.0.0.255
FW(config)#crypto map testmap 1 ipsec-isakmp
FW(config-crypto-map)#set peer 6.0.0.2
FW(config-crypto-map)#set transform-set testform 
FW(config-crypto-map)#match address 101
FW(config-crypto-map)#interface g0/0/0
FW(config-if)#crypto map testmap
```

在分公司div-R配置端到端IPSec VPN，对端为1.0.0.2，认证方式为pre−share，key为123，加密方式为ah−md5−hmac esp−des，从分公司192.168.1.0到总部172.16.0.0的流量加密

```bash
div_R(config)#crypto isakmp enable
div_R(config)#crypto isakmp policy 1
div_R(config-isakmp)#hash md5
div_R(config-isakmp)#authentication pre-share
div_R(config)#crypto isakmp key 123 address 1.0.0.2
div_R(config)#crypto ipsec transform-set testform ah-md5-hmac esp-des
div_R(config)#access-list 101 permit ip 192.168.1.0 0.0.0.255 172.16.0.0 0.0.255.255
div_R(config)#crypto map testmap 1 ipsec-isakmp
div_R(config-crypto-map)#set peer 1.0.0.2
div_R(config-crypto-map)#set transform-set testform
div_R(config-crypto-map)#match address 101
div_R(config-crypto-map)#int g0/0/0
div_R(config-if)#crypto map testmap
```

## 在总部出口路由器上配置静态地址映射，使得外网能访问dmz_srv服务器

在dmz_srv启用http服务，并在dmz_srv使用浏览器访问

![](https://gitee.com/lsyzc/picture/raw/master/picture/202110091929449.jpg)

在FW配置静态地址映射，把172.16.2.1映射到1.0.0.3

```
CODE
ip nat inside source static tcp 172.16.2.1 80 1.0.0.3 80
int f0/1
ip nat inside
```

在PC4访问

![](https://gitee.com/lsyzc/picture/raw/master/picture/202110091929378.jpg)

## IPV6实验网配置

**IPv6地址分配表**

| **设备名**  | **端口/****接口** | **IPv6****地址** | **掩码长度** | **网关**    |
| ----------- | ----------------- | ---------------- | ------------ | ----------- |
| **PC1**     | **Fa0**           | **2001::2**      | **64**       | **2001::1** |
| **PC2**     | **Fa0**           | **2001::3**      | **64**       | **2001::1** |
| **dmz_srv** | **Fa0**           | **2002::2**      | **64**       | **2002::1** |
| **IPv6_R**  | **G0/0**          | **2001::1**      | **64**       | **无**      |
| **FW**      | **F0/1**          | **2002::1**      | **64**       | **无**      |

 

配置PC1和PC2的IPv6地址

![image-20211017212028676](https://gitee.com/lsyzc/picture/raw/master/picture/image-20211017212028676.png) 

![image-20211017212058826](https://gitee.com/lsyzc/picture/raw/master/picture/image-20211017212058826.png)

 配置IPv6_R路由器G0/0接口的IPv6地址并启用接口

```bash
IPv6_R(config)#int g0/0
IPv6_R(config-if)#ipv6 address 2001::1/64
IPv6_R(config-if)#no shutdown
```

配置dmz_srv的IPv6地址

![image-20211017212137669](https://gitee.com/lsyzc/picture/raw/master/picture/image-20211017212137669.png)

配置FW路由器F0/1接口的IPv6地址

```bash
FW(config)#int f0/1
FW(config-if)#ipv6 address 2001::1/64
FW(config-if)#no shutdown
```

配置ipv6隧道

FW端

```bash
a)启用IPv6路由
ipv6 unicast-routing

b)配置双栈接口IPv6地址
interface FastEthernet0/1
ipv6 address 2002::1/64
ipv6 enable
no shutdown

c)配置隧道接口
interface Tunnel0
ipv6 address 2000::1/64
ipv6 enable
no shutdown
tunnel source GigabitEthernet0/0/0
tunnel destination 7.0.0.2
tunnel mode ipv6ip

d)配置IPv6路由
ipv6 route 2001::/64 2000::2
```

IPV6_R

```bash
a)启用IPv6路由
ipv6 unicast-routing

b)配置内部接口IPv6地址
interface GigabitEthernet0/0
ipv6 address 2001::1/64
ipv6 enable
no shutdown

c)配置隧道接口
interface Tunnel0
ipv6 address 2000::2/64
ipv6 enable
no shutdown
tunnel source GigabitEthernet0/0/0
tunnel destination 1.0.0.2
tunnel mode ipv6ip

d)配置IPv6路由
ipv6 route 2002::/64 2000::1
```

## 允许PC33-1访问dmz_srv、禁止访问其它地址、允许所有IP流量

在fw上配置

```bash
FW(config)#access-list 103 permit ip 172.16.33.0 0.0.0.255 172.16.2.0 0.0.0.255
FW(config)#access-list 103 deny ip 172.16.33.0 0.0.0.255 any
FW(config)#access-list 103 permit ip any any
FW(config)#int f0/0
FW(config-if)#ip access-group 103 in
```

